XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F7_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>SONiX</vendor>
  <url>https://liveupdate.sonix.com.tw/sonix/develop_tool/MCU/DFP/</url>
  <name>SN32F7_DFP</name>
  <description>SONiX SN32F7 Series Device Support and Examples</description>

  <releases>
    <release version="1.5.7" date="2022-08-30">
      Change liveupdate serve link to https://liveupdate.sonix.com.tw/sonix/develop_tool/MCU/DFP/
    </release>
    <release version="1.5.6" date="2021-11-17">
      Update SN32F780.svd, SN32F780.h, SN32F790.svd, SN32F790.h
      Update system_SN32F780.c, system_SN32F790.c
    </release>
    <release version="1.5.5" date="2021-01-29">
      Update SN32F770.svd, SN32F770.h, system_SN32F770.c
      Update system_SN32F780.s, system_SN32F790.s
    </release>
    <release version="1.5.4" date="2020-11-20">
      Update SN32F700B.FLM, SN32F770.FLM, and SN32F760B.FLM
      Update system_SN32F780.c, system_SN32F790.c, SN32F780.svd, SN32F790.svd, SN32F780.h, and SN32F790.h
    </release>
    <release version="1.5.3" date="2020-06-22">
      Update SN32F700.svd, SN32F700.h
      Update SN32F780.svd, SN32F780.h, SN32F790.svd, SN32F790.h
    </release>
    <release version="1.5.2" date="2019-12-31">
      Update system_SN32F700.c, system_SN32F760.c, system_SN32F700B.c, system_SN32F780.c
      Update SN32F700B.svd, SN32F700B.h
      Update SN32F700.svd, SN32F700.h
      Update SN32F780.svd, SN32F780.h
      Add SN32F790 related files
    </release>
    <release version="1.5.1" date="2019-09-06">
      Update SN32F780.h, SN32F780.svd, system_SN32F780.c, system_SN32F780.s
    </release>
    <release version="1.5.0" date="2019-07-08">
      Add SN32F780 related files
    </release>
    <release version="1.4.9" date="2019-03-15">
     Update SN32F770.svd and SN32F770.h
     Update SN32F760B.svd and SN32F760B.h
    </release>
    <release version="1.4.8" date="2019-02-04">
     Update SN32F700B.svd and SN32F700B.h
     Update SN32F760.svd and SN32F760.h
    </release>
    <release version="1.4.7" date="2019-01-04">
     Update SN32F700.svd and SN32F700B.h
     Update SN32F700B.svd, SN32F700B.FLM, and SN32F700B.h
     Update SN32F760.svd and SN32F760.h
     Update SN32F760B.svd and SN32F760B.h
     Update SN32F770.svd and SN32F770.h
    </release>
    <release version="1.4.6" date="2018-10-05">
     Remove Code option related files.
     Update SN32F770.svd, system_SN32F770.c
     Update SN32F760B.svd, system_SN32F760B.c, SN32F760B.s
    </release>
    <release version="1.4.5" date="2018-08-24">
      Update SN32F700B.h and SN32F700B.svd
    </release>
    <release version="1.4.4" date="2018-07-30">
      Update SN32F700.h and SN32F700.svd
      Update SN32F760B_64.FLM
    </release>
    <release version="1.4.3" date="2018-01-26">
      Remove the User Manuals.
      Update system_SN32F700.c, system_SN32F700B.c, system_SN32F760.c
      Update SN32F700_Def.h
      Add FLM related files and descriptions for setting Code option.
    </release>
    <release version="1.4.2" date="2017-07-14">
      Update system_SN32F760B.c, SN32F760B.svd, SN32F760B.h, startup_SN32F760B.s
      Update SN32F700.svd, SN32F700.h
      Update SN32F700B.svd, SN32F700B.h, system_SN32F700B.c
      Update SN32F760.svd, SN32F760.h
      Update SN32F770.svd, SN32F770.h, system_SN32F770.c
    </release>
    <release version="1.4.1" date="2017-06-05">
      Update system_SN32F770.c, SN32F770.svd, SN32F770.h
      Update SN32F770 Startkit circuit to V1.0
      Update SN32F700B.svd, SN32F700B.h
    </release>
    <release version="1.4.0" date="2017-05-02">
      Add SN32F760B related files
    </release>
    <release version="1.3.0" date="2017-03-02">
      Add SN32F770 related files
      Update system_SN32F700.c, system_SN32F700B.c
    </release>
    <release version="1.2.3" date="2016-12-09">
      Remove SN32F710/SN32F720/SN32F730/SN32F740/SN32F71XB
    </release>
    <release version="1.2.2" date="2016-07-22">
      Update system_SN32F700.c and SN32F700.h
      Update system_SN32F700B.c
      Update system_SN32F760.c
    </release>
    <release version="1.2.1" date="2015-08-25">
      Fix Device settings for RTX_Blinky sample code of SN32F760 Starter Kit 
      Modify Dname of Device conditions
      Update system_SN32F700.c
      Update system_SN32F760.c
      Add SN32F700B/710B related files
    </release>
    <release version="1.1.0" date="2015-05-06">
      Update SN32F700_Def.h
      Update SN32F760.h, system_SN32F760.c, system_SN32F760.s
      Remove SN32F710/720 related files, and merge them with SN32F700 related files.
      Update User Manual/FLM files/SVD files
      Update Order form of SN32F760 Starter Kit v1.1
    </release>
    <release version="1.0.0" date="2015-05-02">
      First Release version of SN32F7 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>SONiX</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package SONiX</keyword>
    <keyword>SN32F7</keyword>
    <keyword>SN32F7xxB</keyword>
    <keyword>SN32F76xB</keyword>
    <keyword>SN32</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="SN32F7 Series" Dvendor="SONiX:110">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book    name="Documents/dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
        <description>
SN32F7 series 32-bit micro-controller is a new series of extremely Low Power Consumption and High Performance MCU powered by ARM Cortex M0 processor with Flash ROM architecture.
        </description>

      <!-- ************************  Subfamily 'SN32F700'  **************************** -->
      <subFamily DsubFamily="SN32F700">
      	<processor Dclock="50000000"/>
        <compile header="Device/Include/SN32F700.h"  define="SN32F700"/>
        <debug      svd="SVD/SN32F700.svd"/>
        <memory     id="IROM1"                      start="0x00000000"	size="0x8000"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"	init   ="0"	default="1"/>
        <algorithm  name="Flash/SN32F700_32.FLM"    start="0x00000000"  size="0x8000"	RAMstart="0x20000000"	RAMsize="0x2000"	default="1"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>
        <feature type="Timer"         n="2"       m="32"/>
        <feature type="I2S"           n="1"/>
        <feature type="I2C"           n="2"/>
        <feature type="Other"         n="1"                           name="Boot Loader"/>
        <feature type="WDT"           n="1"/>
        <feature type="RTC"           n="1"/>
        <feature type="ExtInt"        n="4"/>
        
      
      <!-- *************************  Device 'SN32F705J'  ***************************** -->
      <device Dname="SN32F705J">
        <feature type="IOs"           n="27"/>
        <feature type="ADC"           n="5"       m="12"/>
        <feature type="Timer"         n="1"       m="16"/>
        <feature type="PWM"           n="11"/>
        <feature type="UART"          n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'SN32F706J'  ***************************** -->
      <device Dname="SN32F706J">
        <feature type="IOs"           n="41"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="PWM"           n="13"/>
        <feature type="USART"         n="1"/>
        <feature type="SPI"           n="2"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F707F'  ***************************** -->
      <device Dname="SN32F707F">
        <feature type="IOs"           n="43"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="PWM"           n="13"/>
        <feature type="UART"          n="1"/>
        <feature type="USART"         n="1"/>
        <feature type="SPI"           n="2"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>
      
      <!-- ************************  Subfamily 'SN32F700B'  **************************** -->
      <subFamily DsubFamily="SN32F700B">
      	<processor Dclock="48000000"/>
        <compile header="Device/Include/SN32F700B.h"  define="SN32F700B"/>
        <debug      svd="SVD/SN32F700B.svd"/>
        <memory     id="IROM1"                      start="0x00000000"	size="0x8000"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"	size="0x2000"	init   ="0"	default="1"/>
        <algorithm  name="Flash/SN32F700B_32.FLM"   start="0x00000000"	size="0x8000"	RAMstart="0x20000000"	RAMsize="0x2000"	default="1"/>
        <feature type="VCC"           n="1.80"    m="5.50"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="Other"         n="2"                           name="CMP"/>
        <feature type="Other"         n="1"                           name="Boot Loader"/>
        <feature type="WDT"           n="1"/>
        <feature type="RTC"           n="1"/>
        <feature type="ExtInt"        n="4"/>

      <!-- *************************  Device 'SN32F705BJ'  ***************************** -->
      <device Dname="SN32F705BJ">
        <feature type="IOs"           n="28"/>
        <feature type="ADC"           n="6"       m="12"/>
        <feature type="PWM"           n="11"/>
        <feature type="UART"          n="1"/>
        <feature type="QFN"           n="33"/>
      </device>
      
