XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F7_DFP.pdsc
      <!-- *************************  Device 'SN32F706BJ'  ***************************** -->
      <device Dname="SN32F706BJ">
        <feature type="IOs"           n="42"/>
        <feature type="ADC"           n="11"      m="12"/>
        <feature type="UART"          n="1"/>
        <feature type="PWM"           n="13"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F707BF'  ***************************** -->
      <device Dname="SN32F707BF">
        <feature type="IOs"           n="44"/>
        <feature type="ADC"           n="11"      m="12"/>
        <feature type="UART"          n="2"/>
        <feature type="PWM"           n="13"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'SN32F750'  **************************** -->
      <subFamily DsubFamily="SN32F750">
        <processor Dclock="50000000"/>
        <compile header="Device/Include/SN32F760.h"  define="SN32F750"/>
        <debug      svd="SVD/SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"	init   ="0"	default="1"/>
        <algorithm  name="Flash/SN32F750_32.FLM"    start="0x00000000"  size="0x8000"	RAMstart="0x20000000"	RAMsize="0x1000"	default="1"/>
        <feature type="VCC"           n="1.80"    m="5.50"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="Timer"         n="3"       m="32"/>
        <feature type="PWM"           n="21"/>
        <feature type="I2C"           n="2"/>
        <feature type="SPI"           n="2"/>
        <feature type="Other"         n="1"                           name="HW divider"/>
        <feature type="Other"         n="1"                           name="Boot Loader"/>
        <feature type="WDT"           n="1"/>
        <feature type="RTC"           n="1"/>
        <feature type="ExtInt"        n="4"/>

      <!-- *************************  Device 'SN32F755J'  ***************************** -->
      <device Dname="SN32F755J">
        <feature type="IOs"           n="26"/>
        <feature type="ADC"           n="4"       m="12"/>
        <feature type="UART"          n="2"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'SN32F756J'  ***************************** -->
      <device Dname="SN32F756J">
        <feature type="IOs"           n="40"/>
        <feature type="ADC"           n="7"       m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="UART"          n="1"/>
        <feature type="USART"         n="1"/>
        <feature type="LCD"           n="17"      m="4"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F757F'  ***************************** -->
      <device Dname="SN32F757F">
        <feature type="IOs"           n="42"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="UART"          n="1"/>
        <feature type="USART"         n="1"/>
        <feature type="LCD"           n="18"      m="4"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'SN32F758F'  ***************************** -->
      <device Dname="SN32F758F">
        <feature type="IOs"           n="57"/>
        <feature type="ADC"           n="11"      m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="UART"          n="1"/>
        <feature type="USART"         n="1"/>
        <feature type="LCD"           n="28"      m="4"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'SN32F759F'  ***************************** -->
      <device Dname="SN32F759F">
        <feature type="IOs"           n="64"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="UART"          n="1"/>
        <feature type="USART"         n="1"/>
        <feature type="LCD"           n="32"      m="4"/>
        <feature type="QFP"           n="80"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'SN32F760'  **************************** -->
      <subFamily DsubFamily="SN32F760">
      	<processor Dclock="50000000"/>
        <compile header="Device/Include/SN32F760.h"  define="SN32F760"/>
        <debug      svd="SVD/SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"	init   ="0"	default="1"/>
        <algorithm  name="Flash/SN32F760_64.FLM"    start="0x00000000"  size="0x10000"	RAMstart="0x20000000"	RAMsize="0x2000"	default="1"/>
        <feature type="VCC"           n="1.80"    m="5.50"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="Timer"         n="3"       m="32"/>
        <feature type="PWM"           n="21"/>
        <feature type="I2C"           n="2"/>
        <feature type="SPI"           n="2"/>
        <feature type="Other"         n="1"                           name="HW divider"/>
        <feature type="Other"         n="1"                           name="Boot Loader"/>
        <feature type="WDT"           n="1"/>
        <feature type="RTC"           n="1"/>
        <feature type="ExtInt"        n="4"/>

      <!-- *************************  Device 'SN32F765J'  ***************************** -->
      <device Dname="SN32F765J">
        <feature type="IOs"           n="26"/>
        <feature type="ADC"           n="4"       m="12"/>
        <feature type="UART"          n="2"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'SN32F766J'  ***************************** -->
      <device Dname="SN32F766J">
        <feature type="IOs"           n="40"/>
        <feature type="ADC"           n="7"       m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="UART"          n="1"/>
        <feature type="USART"         n="1"/>
        <feature type="LCD"           n="17"      m="4"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F767F'  ***************************** -->
      <device Dname="SN32F767F">
        <feature type="IOs"           n="42"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="UART"          n="1"/>
        <feature type="USART"         n="1"/>
        <feature type="LCD"           n="18"      m="4"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'SN32F768F'  ***************************** -->
      <device Dname="SN32F768F">
        <feature type="IOs"           n="57"/>
        <feature type="ADC"           n="11"      m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="UART"          n="1"/>
        <feature type="USART"         n="1"/>
        <feature type="LCD"           n="28"      m="4"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'SN32F769F'  ***************************** -->
      <device Dname="SN32F769F">
        <feature type="IOs"           n="64"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="UART"          n="1"/>
        <feature type="USART"         n="1"/>
        <feature type="LCD"           n="32"      m="4"/>
        <feature type="QFP"           n="80"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'SN32F770'  **************************** -->
      <subFamily DsubFamily="SN32F770">
      	<processor Dclock="48000000"/>
        <compile header="Device/Include/SN32F770.h"  define="SN32F770"/>
        <debug      svd="SVD/SN32F770.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"	init   ="0"	default="1"/>
        <algorithm  name="Flash/SN32F770_32.FLM"    start="0x00000000"  size="0x8000"	RAMstart="0x20000000"	RAMsize="0x1000"	default="1"/>
        <feature type="VCC"           n="1.80"    m="5.50"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="UART"          n="1"/>
        <feature type="WDT"           n="1"/>
	<feature type="ExtInt"        n="3"/>
        <feature type="Other"         n="1"                           name="CMP"/>

      <!-- *************************  Device 'SN32F774S'  ***************************** -->
      <device Dname="SN32F774S">
        <feature type="IOs"           n="26"/>
        <feature type="ADC"           n="6"       m="12"/>
        <feature type="PWM"           n="10"/>
        <feature type="SOP"           n="28"/>
      </device>
      <!-- *************************  Device 'SN32F774T'  ***************************** -->
      <device Dname="SN32F774T">
        <feature type="IOs"           n="26"/>
        <feature type="ADC"           n="6"       m="12"/>
        <feature type="PWM"           n="10"/>
        <feature type="SOP"           n="28"/>
      </device>
      <!-- *************************  Device 'SN32F7741J'  ***************************** -->
      <device Dname="SN32F7741J">
        <feature type="IOs"           n="26"/>
        <feature type="ADC"           n="6"       m="12"/>
        <feature type="PWM"           n="10"/>
        <feature type="QFN"           n="28"/>
      </device>      
      <!-- *************************  Device 'SN32F773S'  ***************************** -->
      <device Dname="SN32F773S">
        <feature type="IOs"           n="22"/>
        <feature type="ADC"           n="5"       m="12"/>
        <feature type="PWM"           n="9"/>
        <feature type="SOP"           n="24"/>
      </device>            
      <!-- *************************  Device 'SN32F773T'  ***************************** -->
      <device Dname="SN32F773T">
        <feature type="IOs"           n="22"/>
        <feature type="ADC"           n="5"       m="12"/>
        <feature type="PWM"           n="9"/>
        <feature type="SOP"           n="24"/>
      </device>
      </subFamily>
      
