XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F7_DFP.pdsc
      <!-- ************************  Subfamily 'SN32F760B'  **************************** -->
      <subFamily DsubFamily="SN32F760B">
      	<processor Dclock="48000000"/>
        <compile header="Device/Include/SN32F760B.h"  define="SN32F760B"/>
        <debug      svd="SVD/SN32F760B.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"	init   ="0"	default="1"/>
        <algorithm  name="Flash/SN32F760B_64.FLM"   start="0x00000000"  size="0x10000"	RAMstart="0x20000000"	RAMsize="0x2000"	default="1"/>
        <feature type="VCC"           n="2.50"    m="5.50"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="WDT"           n="1"/>
        <feature type="Other"         n="1"                           name="Boot Loader"/>
        <feature type="ExtInt"        n="4"/>

      <!-- *************************  Device 'SN32F768BF'  ***************************** -->
      <device Dname="SN32F768BF">
        <feature type="IOs"           n="60"/>
        <feature type="UART"          n="3"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="ADC"           n="16"       m="12"/>
        <feature type="PWM"           n="24"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'SN32F767BF'  ***************************** -->
      <device Dname="SN32F767BF">
        <feature type="IOs"           n="44"/>
        <feature type="UART"          n="3"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="ADC"           n="13"       m="12"/>
        <feature type="PWM"           n="24"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'SN32F766BJ'  ***************************** -->
      <device Dname="SN32F766BJ">
        <feature type="IOs"           n="42"/>
        <feature type="UART"          n="3"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="ADC"           n="12"       m="12"/>
        <feature type="PWM"           n="24"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F7661BF'  ***************************** -->
      <device Dname="SN32F7661BF">
        <feature type="IOs"           n="40"/>
        <feature type="UART"          n="3"/>
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="PWM"           n="23"/>
        <feature type="QFP"           n="44"/>
      </device>
      
      <!-- *************************  Device 'SN32F7652BJ'  ***************************** -->
      <device Dname="SN32F7652BJ">
        <feature type="IOs"           n="27"/>
        <feature type="UART"          n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="ADC"           n="6"       m="12"/>
        <feature type="PWM"           n="17"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'SN32F7651BJ'  ***************************** -->
      <device Dname="SN32F7651BJ">
        <feature type="IOs"           n="27"/>
        <feature type="UART"          n="3"/>
        <feature type="I2C"           n="1"/>
        <feature type="ADC"           n="6"       m="12"/>
        <feature type="PWM"           n="17"/>
        <feature type="QFN"           n="33"/>
      </device>
      </subFamily>
      
      <!-- ************************  Subfamily 'SN32F780'  **************************** -->
      <subFamily DsubFamily="SN32F780">
      	<processor Dclock="72000000"/>
        <compile header="Device/Include/SN32F780.h"  define="SN32F780"/>
        <debug      svd="SVD/SN32F780.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"	init   ="0"	default="1"/>
        <algorithm  name="Flash/SN32F780_128.FLM"   start="0x00000000"  size="0x20000"	RAMstart="0x20000000"	RAMsize="0x8000"	default="1"/>
        <feature type="VCC"           n="2.50"    m="5.50"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="WDT"           n="1"/>
        <feature type="RTC"           n="1"/>
        <feature type="I2C"           n="2"/>
        <feature type="SPI"           n="2"/>
        <feature type="UART"          n="4"/>
        <feature type="I2S"           n="2"/>
	<feature type="ExtInt"        n="4"/>
        <feature type="Other"         n="3"                           name="CMP"/>
        <feature type="Other"         n="2"                           name="OPA"/>
        <feature type="Other"         n="1"                           name="EBI"/>
        <feature type="Other"         n="1"                           name="CRC"/>

      <!-- *************************  Device 'SN32F789F'  ***************************** -->
      <device Dname="SN32F789F">        
        <feature type="IOs"           n="76"/>
        <feature type="ADC"           n="16"	m="12"/>
        <feature type="PWM"           n="36"/>
        <feature type="LCD"           n="36"	m="8"/>
        <feature type="QFP"           n="80"/>
      </device>
      <!-- *************************  Device 'SN32F788F'  ***************************** -->
      <device Dname="SN32F788F">
        <feature type="IOs"           n="60"/>
        <feature type="ADC"           n="16"	m="12"/>
        <feature type="PWM"           n="36"/>
        <feature type="LCD"           n="31"	m="8"/>
        <feature type="QFP"           n="64"/>
      </device>
      <!-- *************************  Device 'SN32F787F'  ***************************** -->
      <device Dname="SN32F787F">
        <feature type="IOs"           n="44"/>
        <feature type="ADC"           n="10"	m="12"/>
        <feature type="PWM"           n="36"/>
        <feature type="LCD"           n="21"	m="4"/>
        <feature type="QFP"           n="48"/>
      </device>
