XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F7_DFP.pdsc
      <!-- *************************  Device 'SN32F785F'  ***************************** -->
      <device Dname="SN32F785F">
        <feature type="IOs"           n="29"/>
        <feature type="ADC"           n="10"	m="12"/>
        <feature type="PWM"           n="30"/>
        <feature type="QFP"           n="32"/>
      </device>
      <!-- *************************  Device 'SN32F785J'  ***************************** -->
      <device Dname="SN32F785J">
        <feature type="IOs"           n="29"/>
        <feature type="ADC"           n="10"	m="12"/>
        <feature type="PWM"           n="30"/>
        <feature type="QFN"           n="32"/>
      </device>
      </subFamily>
      
      <!-- ************************  Subfamily 'SN32F790'  **************************** -->
      <subFamily DsubFamily="SN32F790">
      	<processor Dclock="72000000"/>
        <compile header="Device/Include/SN32F790.h"  define="SN32F790"/>
        <debug      svd="SVD/SN32F790.svd"/>
        <memory     id="IROM1"                      start="0x00000000"	size="0x40000"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"	init   ="0"	default="1"/>
        <algorithm  name="Flash/SN32F790_256.FLM"   start="0x00000000"  size="0x20000"	RAMstart="0x20000000"	RAMsize="0x8000"	default="1"/>
        <feature type="VCC"           n="2.50"	m="5.50"/>
        <feature type="Timer"         n="6"	m="16"/>
        <feature type="WDT"           n="1"/>
        <feature type="RTC"           n="1"/>
        <feature type="I2C"           n="2"/>
        <feature type="UART"          n="4"/>
        <feature type="I2S"           n="2"/>
	<feature type="ExtInt"        n="4"/>
        <feature type="Other"         n="3"                           name="CMP"/>
        <feature type="Other"         n="2"                           name="OPA"/>
        <feature type="Other"         n="1"                           name="EBI"/>
        <feature type="Other"         n="1"                           name="CRC"/>

      <!-- *************************  Device 'SN32F799F'  ***************************** -->
      <device Dname="SN32F799F">
        <feature type="IOs"           n="76"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="PWM"           n="36"/>
        <feature type="LCD"           n="36"      m="8"/>
        <feature type="SPI"           n="2"/>
        <feature type="QFP"           n="80"/>
      </device>
      <!-- *************************  Device 'SN32F798F'  ***************************** -->
      <device Dname="SN32F798F">
        <feature type="IOs"           n="60"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="PWM"           n="36"/>
        <feature type="LCD"           n="31"      m="8"/>
        <feature type="SPI"           n="2"/>
        <feature type="QFP"           n="64"/>
      </device>
      <!-- *************************  Device 'SN32F797F'  ***************************** -->
      <device Dname="SN32F797F">
        <feature type="IOs"           n="44"/>
        <feature type="ADC"           n="10"       m="12"/>
        <feature type="PWM"           n="36"/>
        <feature type="LCD"           n="21"      m="4"/>
        <feature type="SPI"           n="2"/>
        <feature type="QFP"           n="48"/>
      </device>
      <!-- *************************  Device 'SN32F795F'  ***************************** -->
      <device Dname="SN32F795F">
        <feature type="IOs"           n="29"/>
        <feature type="ADC"           n="10"	m="12"/>
        <feature type="PWM"           n="30"/>
        <feature type="SPI"           n="1"/>
        <feature type="QFP"           n="32"/>
      </device>
      <!-- *************************  Device 'SN32F795J'  ***************************** -->
      <device Dname="SN32F795J">
        <feature type="IOs"           n="29"/>
        <feature type="ADC"           n="10"	m="12"/>
        <feature type="PWM"           n="30"/>
        <feature type="SPI"           n="1"/>
        <feature type="QFN"           n="32"/>
      </device>
      <!-- *************************  Device 'SN32F7951F'  ***************************** -->
      <device Dname="SN32F7951F">
        <feature type="IOs"           n="30"/>
        <feature type="ADC"           n="9"	m="12"/>
        <feature type="PWM"           n="31"/>
        <feature type="SPI"           n="2"/>
        <feature type="QFP"           n="32"/>
      </device>
      <!-- *************************  Device 'SN32F7951J'  ***************************** -->
      <device Dname="SN32F7951J">
        <feature type="IOs"           n="30"/>
        <feature type="ADC"           n="9"	m="12"/>
        <feature type="PWM"           n="31"/>
        <feature type="SPI"           n="2"/>
        <feature type="QFN"           n="32"/>
      </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARM">
      <require Tcompiler="ARMCC"/>
    </condition>
    
    <!-- Device Conditions -->
    <condition id="SN32F70_1_2">
      <description>SONiX SN32F700_10_20 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F70??"/>
    </condition>
    
    <condition id="SN32F73_4_5_6">
      <description>SONiX SN32F730_40_50_60 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F75??"/>
      <accept Dvendor="SONiX:110" Dname="SN32F76??"/>
    </condition>

    <condition id="SN32F77">
      <description>SONiX SN32F770 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F77??*"/>
    </condition>

    <condition id="SN32F78">
      <description>SONiX SN32F780 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F78??*"/>
    </condition>
    
    <condition id="SN32F79">
      <description>SONiX SN32F790 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F79??*"/>
    </condition>

    <condition id="SN32F70_1B">
      <description>SONiX SN32F700_10B Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F70*B*"/>
    </condition>

