XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F7_DFP.pdsc
    <condition id="SN32F760B">
      <description>SONiX SN32F760B Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F76*B*"/>
    </condition>

    
    
    <!-- Device + CMSIS Conditions -->
    <condition id="SN32F70_1_2 CMSIS Device">
      <description>SONiX SN32F700_10_20 series Devices and CMSIS-Core</description>
      <require condition="SN32F70_1_2"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    
    <condition id="SN32F73_4_5_6 CMSIS Device">
      <description>SONiX SN32F730_40_50_60 series Devices and CMSIS-Core</description>
      <require condition="SN32F73_4_5_6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SN32F77 CMSIS Device">
      <description>SONiX SN32F770 series Devices and CMSIS-Core</description>
      <require condition="SN32F77"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SN32F78 CMSIS Device">
      <description>SONiX SN32F780 series Devices and CMSIS-Core</description>
      <require condition="SN32F78"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    
     <condition id="SN32F79 CMSIS Device">
      <description>SONiX SN32F790 series Devices and CMSIS-Core</description>
      <require condition="SN32F79"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SN32F70_1B CMSIS Device">
      <description>SONiX SN32F700_10B series Devices and CMSIS-Core</description>
      <require condition="SN32F70_1B"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SN32F760B CMSIS Device">
      <description>SONiX SN32F760B Series devices and CMSIS-CORE</description>
      <require condition="SN32F760B"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>


  <boards>
    <board vendor="SONiX" name="SN32F760 Starter Kit Rev1_1" revision="v1.1" salesContact="sales@sonix.com.tw" orderForm="http://www.sonix.com.tw/article-en-1019-4193#">
      <description>SONiX SN32F760 Starter Kit</description>
      <book category="schematic" name="Documents/SN32F760_STARTKIT_V1.1.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="SONiX:110" Dname="SN32F76*"/>
      <compatibleDevice deviceIndex="0" Dvendor="SONiX:110" Dfamily="SN32F760"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"              name="Push-buttons: User and Reset"/>
      <feature type="USB"       n="1"              name="USB device with USB Standard-B Connector"/>
      <feature type="RS232"     n="1"              name="DB9 Female Connector"/>
      <feature type="DIO"       n="41"             name="Digital IOs (shared with Analog IOs)"/>
      <feature type="LED"       n="2"              name="LEDs: One user, one PWR LED"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
    </board>
    
    <board vendor="SONiX" name="SN32F707B Starter Kit Rev1_0" revision="v1.0" salesContact="sales@sonix.com.tw" orderForm="http://www.sonix.com.tw/article-en-1019-4193#">
      <description>SONiX SN32F707B Starter Kit</description>
      <book category="schematic" name="Documents/SN32F700B_STARTKIT_V1.0.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="SONiX:110" Dname="SN32F70*B"/>
      <compatibleDevice deviceIndex="0" Dvendor="SONiX:110" Dfamily="SN32F700B"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="4"              name="Push-buttons: User and Reset"/>
      <feature type="RS232"     n="1"              name="DB9 Female Connector"/>
      <feature type="DIO"       n="44"             name="Digital IOs (shared with Analog IOs)"/>
      <feature type="LED"       n="3"              name="LEDs: Two user, one PWR LED"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
    </board>

    <board vendor="SONiX" name="SN32F770 Starter Kit Rev1_0" revision="v1.0" salesContact="sales@sonix.com.tw" orderForm="http://www.sonix.com.tw/article-en-1019-4193#">
      <description>SONiX SN32F770 Starter Kit</description>
      <book category="schematic" name="Documents/SN32F770_STARTKIT_V1.0.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="SONiX:110" Dname="SN32F77*"/>
      <compatibleDevice deviceIndex="0" Dvendor="SONiX:110" Dfamily="SN32F770"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="4"              name="Push-buttons: User and Reset"/>
      <feature type="RS232"     n="1"              name="DB9 Female Connector"/>
      <feature type="DIO"       n="26"             name="Digital IOs (shared with Analog IOs)"/>
      <feature type="LED"       n="3"              name="LEDs: Two user, one PWR LED"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
    </board>
    
    <board vendor="SONiX" name="SN32F790 Starter Kit Rev1_1" revision="v1.1" salesContact="sales@sonix.com.tw" orderForm="http://www.sonix.com.tw/article-en-1019-4193#">
      <description>SONiX SN32F790 Starter Kit</description>
      <book category="schematic" name="Documents/SN32F790_STARTKIT_V1.1.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="SONiX:110" Dname="SN32F79*"/>
      <compatibleDevice deviceIndex="0" Dvendor="SONiX:110" Dfamily="SN32F790"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="4"              name="Push-buttons: User and Reset"/>
      <feature type="RS232"     n="1"              name="DB9 Female Connector"/>
      <feature type="DIO"       n="26"             name="Digital IOs (shared with Analog IOs)"/>
      <feature type="LED"       n="3"              name="LEDs: Two user, one PWR LED"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/SONiX/SN32F700B Starter Kit Rev1_0/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SN32F707B Starter Kit Rev1_0" vendor="SONiX" Dvendor="SONiX:110"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/SONiX/SN32F760 Starter Kit Rev1_1/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SN32F760 Starter Kit Rev1_1" vendor="SONiX" Dvendor="SONiX:110"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/SONiX/SN32F770 Starter Kit Rev1_0/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SN32F770 Starter Kit Rev1_0" vendor="SONiX" Dvendor="SONiX:110"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    
