XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F7_DFP.pdsc
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/SONiX/SN32F790 Starter Kit Rev1_1/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SN32F790 Starter Kit Rev1_1" vendor="SONiX" Dvendor="SONiX:110"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

  <components>  
    <!-- Startup SN32F70_1_2 -->  
    <component Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="SN32F70_1_2 CMSIS Device">
      <description>System Startup for SONiX SN32F700 Series</description>     
      <files>
        <file category="include"	name="Device/Include/"/>
        <file category="sourceAsm"	name="Device/Source/ARM/startup_SN32F700.s"	attr="config"	version="1.1.0"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device/Source/system_SN32F700.c"		attr="config"   version="1.2.0"/>   
      </files>
    </component>
    
    <!-- Startup SN32F73_4_5_6 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="SN32F73_4_5_6 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F760 Series</description>
      <files>
        <file category="include"	name="Device/Include/"/>
        <file category="sourceAsm"	name="Device/Source/ARM/startup_SN32F760.s"   attr="config"    version="1.1.0"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device/Source/system_SN32F760.c"        attr="config"    version="1.3.0"/>
      </files>
    </component>

    <!-- Startup SN32F77 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="SN32F77 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F770 Series</description>
      <files>
        <file category="include"	name="Device/Include/"/>
        <file category="sourceAsm"	name="Device/Source/ARM/startup_SN32F770.s"   attr="config"    version="1.0.0"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device/Source/system_SN32F770.c"        attr="config"    version="1.2.0"/>
      </files>
    </component>
    
    <!-- Startup SN32F78 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.2" condition="SN32F78 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F780 Series</description>
      <files>
        <file category="include"	name="Device/Include/"/>
        <file category="sourceAsm"	name="Device/Source/ARM/startup_SN32F780.s"   attr="config"    version="1.1.0"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device/Source/system_SN32F780.c"        attr="config"    version="1.1.2"/>
      </files>
    </component>
    
    <!-- Startup SN32F79 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.2" condition="SN32F79 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F790 Series</description>
      <files>
        <file category="include"	name="Device/Include/"/>
        <file category="sourceAsm"	name="Device/Source/ARM/startup_SN32F790.s"   attr="config"    version="1.1.0"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device/Source/system_SN32F790.c"        attr="config"    version="1.1.2"/>
      </files>
    </component>

    <!-- Startup SN32F70_1B -->  
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="SN32F70_1B CMSIS Device">
      <description>System Startup for SONiX SN32F700B Series</description>     
      <files>
        <file category="include"	name="Device/Include/"/>
        <file category="sourceAsm"	name="Device/Source/ARM/startup_SN32F700B.s"	attr="config"	version="1.0.0"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device/Source/system_SN32F700B.c"		attr="config"   version="1.1.0"/>   
      </files>
    </component>

    <!-- Startup SN32F760B -->  
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="SN32F760B CMSIS Device">
      <description>System Startup for SONiX SN32F760B Series</description>
      <files>
        <file category="include"	name="Device/Include/"/>
        <file category="sourceAsm"	name="Device/Source/ARM/startup_SN32F760B.s"    attr="config"	version="1.1.0"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device/Source/system_SN32F760B.c"         attr="config"    version="1.1.0"/>
      </files>
    </component>
  </components>
</package>
